```terraform
module.portfolio_site.aws_route53_zone.main: Refreshing state... [id=Z0013639KNTP07FVLNW]
module.portfolio_site.aws_route53_record.website: Refreshing state... [id=Z0013639KNTP07FVLNW_doctrine_A]
module.portfolio_site.aws_s3_bucket.website: Refreshing state... [id=engineering-doctrine]
module.portfolio_site.aws_s3_bucket_versioning.website: Refreshing state... [id=engineering-doctrine]
module.portfolio_site.aws_s3_bucket_public_access_block.website: Refreshing state... [id=engineering-doctrine]
module.portfolio_site.aws_s3_bucket_website_configuration.website: Refreshing state... [id=engineering-doctrine]
module.portfolio_site.aws_s3_bucket_server_side_encryption_configuration.website: Refreshing state... [id=engineering-doctrine]
module.portfolio_site.aws_cloudfront_origin_access_identity.origin_access_identity: Refreshing state... [id=E1BJHVINC5U94A]
module.portfolio_site.data.aws_iam_policy_document.bucket_policy: Reading...
module.portfolio_site.data.aws_iam_policy_document.bucket_policy: Read complete after 0s [id=4037827660]
module.portfolio_site.aws_s3_bucket_policy.website: Refreshing state... [id=engineering-doctrine]
module.portfolio_site.aws_cloudfront_distribution.website: Refreshing state... [id=E3JA2HVFHG9A5H]
module.portfolio_site.null_resource.build_and_deploy_site: Refreshing state... [id=6646302423456956763]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.portfolio_site.aws_cloudfront_distribution.website will be updated in-place
  ~ resource "aws_cloudfront_distribution" "website" {
      ~ aliases                        = [
          + "portfolio.stevemassey.net",
            # (1 unchanged element hidden)
        ]
        id                             = "E3JA2HVFHG9A5H"
        tags                           = {}
        # (19 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.portfolio_site.aws_route53_record.alias_1 will be created
  + resource "aws_route53_record" "alias_1" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "doctrine"
      + type            = "A"
      + zone_id         = "Z0013639KNTP07FVLNW"

      + alias {
          + evaluate_target_health = false
          + name                   = "d12hpwos05siyx.cloudfront.net"
          + zone_id                = "Z2FDTNDATAQYW2"
        }
    }

  # module.portfolio_site.aws_route53_record.alias_2 will be created
  + resource "aws_route53_record" "alias_2" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "portfolio"
      + type            = "A"
      + zone_id         = "Z0013639KNTP07FVLNW"

      + alias {
          + evaluate_target_health = false
          + name                   = "d12hpwos05siyx.cloudfront.net"
          + zone_id                = "Z2FDTNDATAQYW2"
        }
    }

  # module.portfolio_site.aws_route53_record.website will be destroyed
  # (because aws_route53_record.website is not in configuration)
  - resource "aws_route53_record" "website" {
      - fqdn                             = "doctrine.stevemassey.net" -> null
      - id                               = "Z0013639KNTP07FVLNW_doctrine_A" -> null
      - multivalue_answer_routing_policy = false -> null
      - name                             = "doctrine" -> null
      - records                          = [] -> null
      - ttl                              = 0 -> null
      - type                             = "A" -> null
      - zone_id                          = "Z0013639KNTP07FVLNW" -> null

      - alias {
          - evaluate_target_health = false -> null
          - name                   = "d12hpwos05siyx.cloudfront.net" -> null
          - zone_id                = "Z2FDTNDATAQYW2" -> null
        }
    }

  # module.portfolio_site.null_resource.build_and_deploy_site must be replaced
-/+ resource "null_resource" "build_and_deploy_site" {
      ~ id       = "6646302423456956763" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "src_hash"     = "79798da5e3fe734207be9f375f9fbc9cf9dac591fc9f292e852c25ff4f1eae5207eed53ef0ac91df2c06ded4fa27840bf8d2980dfc64bba748acf8f31e75a3490ba14ef9a20983fb0b51fec8fb335329c56acd7a43007fbf2543c8288aa7b887df3d585bb59342779c3ca2e49800905235b265eb10a0b6ee257d5db1af33d5b4b398ef4275f3309a39f056e1f61fa2ce6438f8a7d8a652c30fbeef8e7560a9f4628288a8d21fe654d613e9c77d3a34db62694fd104aa06a14810e65b32019eac6cd0baa4e2c9d6f3a9dbc21ed9b53d8e707c0e2280e537ba7c707c70a0206399d6cfcf2d4d7d374d757e9999ee909e5392d26723e0ffa690f1c01ffa13352127d804b3235472163bdc2916dc420551b7c492a79f14d2634c995151dba40345d50ca420d00b8acb5e5b390aa62a1acc293ccd774c113c5e3b015eb9be439f7ae8493f6c66e7bc8289428d2b81d709ba296cac076bca759a99b9b31a31f4d8713278752778f20eca6b3d589f7f046cac3e7b3451dde68f26e0544f99701f313960ae785ec0422f43d6037c1d68da6102eb062cd5e8e0adeed3b40aba26df7ebe99a79dd432dd58bac649c9c022c00459214d53bf69cb85b35e0eef9ddfc279f86fe1687c21805f549002c1b49fa853900000ec61263656f70e60287717b8acd194d37833a858cdb28e6cfd0b22cb694ea43b18ace0ba6c1502db6735a14aa62026caac13e1bb502642ab91de50844b9dad411a361e6189766651775c835127f9435dcba4432aaed129001ab7507958e7831af88d848b4b9f194fbeb53ba5f4d5d2de7eb2e78951b8d26bc088c0647522012495c0b874e16bfe127058e3ec87eeb609b2dacc67e0edf7bc6f6d0d53c5244ac08c45581cbc4fb891ff0df3fc7314c1355c1c782aacd8ee13a75c2c69ad70fcfac688c987e74a205f55f43de7af7df1661de184332107d339f207b1cea2a6c193b5951bce8f7413827ffaa4c938f596f9a48663494182f6d8f42b42d777ca66ae8b7793b12765a397b8bd1ab3a64c41203693654d78977cad1a05a944deb4b654cb721c917536cea2c56d29d96899b2dcfdd058bc633fec2b38c4a7cea00c297bae6efd75c5362ec07d39c7ac650fa7d4c8462e97b7d1ba72231c481a4678fe839e64cc63e5a40397548c828cccb1f4a0876a6147edb09a84a238107efad51932c10054c960c02289cb475af0e539d9354d520cf8f3bf7c921572e4f8f720aa4764463477421522261790c73f9cd4d719ddac276a41deab51ae976caa30db96c2c029dfad4d9f678b55c46d10c5fff43f20f9e18b20155ed8d2aa74843522acf831fc8ac0c4b72551261a4de99206c8d586778b6b407c2f8603869eb17e1b0b2ad6138f1d018316d8953967a8936bb0" -> "79798da5e3fe734207be9f375f9fbc9cf9dac591fc9f292e852c25ff4f1eae5207eed53ef0ac91df2c06ded4fa27840bf8d2980dfc64bba748acf8f31e75a3490ba14ef9a20983fb0b51fec8fb335329c56acd7a43007fbf2543c8288aa7b887df3d585bb59342779c3ca2e49800905235b265eb10a0b6ee257d5db1af33d5b4b398ef4275f3309a39f056e1f61fa2ce6438f8a7d8a652c30fbeef8e7560a9f46c9ec5a8cd2d19aeed5f176633ea5adbe91b7aefb221f1578aa4eea6b44a673f6cd0baa4e2c9d6f3a9dbc21ed9b53d8e707c0e2280e537ba7c707c70a0206399d6cfcf2d4d7d374d757e9999ee909e5392d26723e0ffa690f1c01ffa13352127d804b3235472163bdc2916dc420551b7c492a79f14d2634c995151dba40345d50ca420d00b8acb5e5b390aa62a1acc293ccd774c113c5e3b015eb9be439f7ae8493f6c66e7bc8289428d2b81d709ba296cac076bca759a99b9b31a31f4d8713278752778f20eca6b3d589f7f046cac3e7b3451dde68f26e0544f99701f313960ae785ec0422f43d6037c1d68da6102eb062cd5e8e0adeed3b40aba26df7ebe99a79dd432dd58bac649c9c022c00459214d53bf69cb85b35e0eef9ddfc279f86fe1687c21805f549002c1b49fa853900000ec61263656f70e60287717b8acd194d37833a858cdb28e6cfd0b22cb694ea43b18ace0ba6c1502db6735a14aa62026caac13e1bb502642ab91de50844b9dad411a361e6189766651775c835127f9435dcba4432aaed129001ab7507958e7831af88d848b4b9f194fbeb53ba5f4d5d2de7eb2e78951b8d26bc088c0647522012495c0b874e16bfe127058e3ec87eeb609b2dacc67e0edf7bc6f6d0d53c5244ac08c45581cbc4fb891ff0df3fc7314c1355c1c782aacd8ee13a75c2c69ad70fcfac688c987e74a205f55f43de7af7df1661de184332107d339f207b1cea2a6c193b5951bce8f7413827ffaa4c938f596f9a48663494182f6d8f42b42d777ca66ae8b7793b12765a397b8bd1ab3a64c41203693654d78977cad1a05a944deb4b654cb721c917536cea2c56d29d96899b2dcfdd058bc633fec2b38c4a7cea00c297bae6efd75c5362ec07d39c7ac650fa7d4c8462e97b7d1ba72231c481a4678fe839e64cc63e5a40397548c828cccb1f4a0876a6147edb09a84a238107efad51932c10054c960c02289cb475af0e539d9354d520cf8f3bf7c921572e4f8f720aa4764463477421522261790c73f9cd4d7bddddd38cbd5cd7cbf5547b609045a77d0772c185f4dac7e9c518afe67fa53a73f20f9e18b20155ed8d2aa74843522acf831fc8ac0c4b72551261a4de99206c8d586778b6b407c2f8603869eb17e1b0b2ad6138f1d018316d8953967a8936bb0"
            # (1 unchanged element hidden)
        }
    }

Plan: 3 to add, 1 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```
<!-- Sticky Pull Request Commentterraform-plan -->